## Plan Result (dts_sharedservicesptl_sbox_acme)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * azurerm_application_insights.appinsight
* Replace
  * azurerm_role_assignment.app-proxy-ga-service-connection-certificate-management[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.appinsight will be updated in-place
  ~ resource "azurerm_application_insights" "appinsight" {
        id                                    = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/sds-platform-ptlsbox-rg/providers/Microsoft.Insights/components/sds-platform-ptlsbox"
        name                                  = "sds-platform-ptlsbox"
        tags                                  = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-enterprise-acme"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
            "startupMode"  = "always"
        }
      - workspace_id                          = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-sandbox" -> null
        # (15 unchanged attributes hidden)
    }

  # azurerm_role_assignment.app-proxy-ga-service-connection-certificate-management[0] must be replaced
-/+ resource "azurerm_role_assignment" "app-proxy-ga-service-connection-certificate-management" {
      ~ id                               = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/resourceGroups/sds-platform-ptlsbox-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsptlsbox/providers/Microsoft.Authorization/roleAssignments/83b92753-0b6c-f29c-49c4-351fe489e805" -> (known after apply)
      ~ name                             = "83b92753-0b6c-f29c-49c4-351fe489e805" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768/providers/Microsoft.Authorization/roleDefinitions/a4417e6f-fecd-4de8-b567-7b0420556985" -> (known after apply)
      ~ role_definition_name             = "Key Vault Certificates Officer" -> "Key Vault Secrets User" # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":32,"Program":"tfcmt","SHA1":"","Target":"dts_sharedservicesptl_sbox_acme","Vars":{}} -->